In [2]:
import numpy as np 
import pandas as pd

## create a data frame

### âœ… Why DataFrame is used?
##### Store structured data
##### Easy filtering, sorting, analysis
##### Used in Data Science, ML, CSV/Excel handling

In [3]:
data = {
    'Name' : ['kaushik','janvi','punit','dharmesh','ram'],
    'Age' : [22,21,23,24,25],
    'City' : ['Ahmedabad','Pune','Vadodra','Rajkot','Junagadh'],
    'Salary' : [90000,100000,120000,30000,20000]
}
data

{'Name': ['kaushik', 'janvi', 'punit', 'dharmesh', 'ram'],
 'Age': [22, 21, 23, 24, 25],
 'City': ['Ahmedabad', 'Pune', 'Vadodra', 'Rajkot', 'Junagadh'],
 'Salary': [90000, 100000, 120000, 30000, 20000]}

In [6]:
df = pd.DataFrame(data)
df

       Name  Age       City  Salary
0   kaushik   22  Ahmedabad   90000
1     janvi   21       Pune  100000
2     punit   23    Vadodra  120000
3  dharmesh   24     Rajkot   30000
4       ram   25   Junagadh   20000

In [7]:
my_list = [
    ['vivek','MCA','parul university','Vadodra'],
    ['vijay','MBA','MSU','Vadodra'],
    ['parth','BBA','Rai university','Ahmedabad'],
    ['kinjal','MBBS','Gujarat university','Ahmedabad'],
    ['Dhara','B.com','Silver owak','Gandhinagar']
]

In [8]:
my_list

[['vivek', 'MCA', 'parul university', 'Vadodra'],
 ['vijay', 'MBA', 'MSU', 'Vadodra'],
 ['parth', 'BBA', 'Rai university', 'Ahmedabad'],
 ['kinjal', 'MBBS', 'Gujarat university', 'Ahmedabad'],
 ['Dhara', 'B.com', 'Silver owak', 'Gandhinagar']]

In [10]:
df1 = pd.DataFrame(my_list)
df1

        0      1                   2            3
0   vivek    MCA    parul university      Vadodra
1   vijay    MBA                 MSU      Vadodra
2   parth    BBA      Rai university    Ahmedabad
3  kinjal   MBBS  Gujarat university    Ahmedabad
4   Dhara  B.com         Silver owak  Gandhinagar

In [11]:
column = ['Name','Stream','University','Address']
df2 = pd.DataFrame(my_list,columns=column)
df2

     Name Stream          University      Address
0   vivek    MCA    parul university      Vadodra
1   vijay    MBA                 MSU      Vadodra
2   parth    BBA      Rai university    Ahmedabad
3  kinjal   MBBS  Gujarat university    Ahmedabad
4   Dhara  B.com         Silver owak  Gandhinagar